bench/haproxy.log
sysbench 1.0.20 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 3
Report intermediate results every 5 second(s)
Initializing random number generator from current time

Forcing shutdown in 301 seconds

Initializing worker threads...

Threads started!

[ 5s ] thds: 3 tps: 760.51 qps: 22061.42 (r/w/o: 22061.42/0.00/0.00) lat (ms,95%): 4.91 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 3 tps: 735.46 qps: 21326.28 (r/w/o: 21326.28/0.00/0.00) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 3 tps: 729.39 qps: 21153.19 (r/w/o: 21153.19/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 3 tps: 700.19 qps: 20308.42 (r/w/o: 20308.42/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 3 tps: 705.00 qps: 20447.15 (r/w/o: 20447.15/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 3 tps: 707.18 qps: 20508.64 (r/w/o: 20508.64/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 3 tps: 704.20 qps: 20422.30 (r/w/o: 20422.30/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 3 tps: 712.81 qps: 20670.43 (r/w/o: 20670.43/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 3 tps: 721.76 qps: 20924.21 (r/w/o: 20924.21/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 3 tps: 711.03 qps: 20628.49 (r/w/o: 20628.49/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 3 tps: 719.58 qps: 20865.35 (r/w/o: 20865.35/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 3 tps: 712.41 qps: 20659.53 (r/w/o: 20659.53/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 3 tps: 719.38 qps: 20864.36 (r/w/o: 20864.36/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 3 tps: 711.22 qps: 20617.88 (r/w/o: 20617.88/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 3 tps: 709.60 qps: 20583.10 (r/w/o: 20583.10/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 3 tps: 702.20 qps: 20360.59 (r/w/o: 20360.59/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 3 tps: 708.99 qps: 20563.18 (r/w/o: 20563.18/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 3 tps: 713.00 qps: 20681.78 (r/w/o: 20681.78/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 3 tps: 719.79 qps: 20873.15 (r/w/o: 20873.15/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 3 tps: 707.07 qps: 20495.17 (r/w/o: 20495.17/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 3 tps: 716.39 qps: 20779.31 (r/w/o: 20779.31/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 3 tps: 720.62 qps: 20898.95 (r/w/o: 20898.95/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 3 tps: 724.16 qps: 21002.88 (r/w/o: 21002.88/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 3 tps: 713.03 qps: 20680.37 (r/w/o: 20680.37/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 3 tps: 721.79 qps: 20931.47 (r/w/o: 20931.47/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 3 tps: 719.99 qps: 20877.73 (r/w/o: 20877.73/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 3 tps: 714.00 qps: 20703.30 (r/w/o: 20703.30/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 3 tps: 703.40 qps: 20404.90 (r/w/o: 20404.90/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 3 tps: 698.59 qps: 20258.22 (r/w/o: 20258.22/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 3 tps: 715.17 qps: 20739.60 (r/w/o: 20739.60/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 3 tps: 706.65 qps: 20490.25 (r/w/o: 20490.25/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 3 tps: 717.84 qps: 20819.02 (r/w/o: 20819.02/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 3 tps: 712.16 qps: 20642.73 (r/w/o: 20642.73/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 3 tps: 727.21 qps: 21096.41 (r/w/o: 21096.41/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 3 tps: 721.38 qps: 20920.65 (r/w/o: 20920.65/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 3 tps: 721.41 qps: 20921.70 (r/w/o: 20921.70/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 3 tps: 723.19 qps: 20968.85 (r/w/o: 20968.85/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 3 tps: 722.80 qps: 20963.93 (r/w/o: 20963.93/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 3 tps: 716.59 qps: 20779.02 (r/w/o: 20779.02/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 3 tps: 687.98 qps: 19956.85 (r/w/o: 19956.85/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 3 tps: 716.01 qps: 20759.03 (r/w/o: 20759.03/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 3 tps: 715.82 qps: 20761.78 (r/w/o: 20761.78/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 3 tps: 720.58 qps: 20890.38 (r/w/o: 20890.38/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 3 tps: 715.42 qps: 20749.91 (r/w/o: 20749.91/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 3 tps: 709.79 qps: 20583.41 (r/w/o: 20583.41/0.00/0.00) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 3 tps: 726.20 qps: 21059.87 (r/w/o: 21059.87/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 3 tps: 720.00 qps: 20886.55 (r/w/o: 20886.55/0.00/0.00) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 3 tps: 730.01 qps: 21166.78 (r/w/o: 21166.78/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 3 tps: 724.99 qps: 21025.80 (r/w/o: 21025.80/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 3 tps: 717.40 qps: 20800.90 (r/w/o: 20800.90/0.00/0.00) lat (ms,95%): 5.37 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 3 tps: 723.82 qps: 20994.82 (r/w/o: 20994.82/0.00/0.00) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 3 tps: 688.98 qps: 19982.64 (r/w/o: 19982.64/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 3 tps: 689.00 qps: 19976.33 (r/w/o: 19976.33/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 3 tps: 687.53 qps: 19937.11 (r/w/o: 19937.11/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 3 tps: 677.28 qps: 19638.79 (r/w/o: 19638.79/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 3 tps: 660.61 qps: 19161.78 (r/w/o: 19161.78/0.00/0.00) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 3 tps: 673.18 qps: 19525.04 (r/w/o: 19525.04/0.00/0.00) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 3 tps: 688.80 qps: 19975.26 (r/w/o: 19975.26/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 3 tps: 671.20 qps: 19467.72 (r/w/o: 19467.72/0.00/0.00) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 3 tps: 685.35 qps: 19874.68 (r/w/o: 19874.68/0.00/0.00) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            6185410
        write:                           0
        other:                           0
        total:                           6185410
    transactions:                        213290 (710.95 per sec.)
    queries:                             6185410 (20617.60 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0046s
    total number of events:              213290

Latency (ms):
         min:                                    2.44
         avg:                                    4.22
         max:                                   42.14
         95th percentile:                        5.37
         sum:                               899713.53

Threads fairness:
    events (avg/stddev):           71096.6667/89.13
    execution time (avg/stddev):   299.9045/0.00